In [31]:
import pandas as pd
import numpy as np
from PIL import Image

In [32]:
X = pd.read_csv("../raw_data/train_x.csv", delimiter=" ", index_col="Id")
y = pd.read_csv("../raw_data/train_y.csv", delimiter=" ", index_col="Id")

In [33]:
X

           Image_name                                              Title
Id
0      1588345297.jpg         With Schwarzkopf: Life Lessons of The Bear
1      1404803335.jpg  Magnets: Pulling Together, Pushing Apart (Amaz...
2      1446276082.jpg  Energy Security (SAGE Library of International...
3      1491522666.jpg       An Amish Gathering: Life in Lancaster County
4      0970096410.jpg  City of Rocks Idaho: A Climber's Guide (Region...
...               ...                                                ...
51295  0399176055.jpg                                       Extreme Prey
51296  0719816629.jpg  The Crime Writer's Guide to Police Practice an...
51297  0385353596.jpg                        The Jezebel Remedy: A novel
51298  1475988559.jpg                                            Startup
51299  045147483X.jpg     Killer Takeout: A Key West Food Critic Mystery

[51300 rows x 2 columns]

In [34]:
y

       Genre_id                    Genre_name
Id
0             1         Biographies & Memoirs
1             4              Children's Books
2            10  Engineering & Transportation
3             9      Christian Books & Bibles
4            26             Sports & Outdoors
...         ...                           ...
51295        17  Mystery, Thriller & Suspense
51296        17  Mystery, Thriller & Suspense
51297        17  Mystery, Thriller & Suspense
51298        17  Mystery, Thriller & Suspense
51299        17  Mystery, Thriller & Suspense

[51300 rows x 2 columns]

In [35]:
genre_dict = y.set_index('Genre_id')['Genre_name'].to_dict()

In [40]:
average_colors = []
missing_images = []


for image_name in X['Image_name']:
    try:
        image_path = "../raw_data/Images/" + image_name  # Assuming the images are stored in the "../raw_data/images/" directory
        image = Image.open(image_path)
        average_color = np.array(image).mean(axis=(0, 1))
        average_colors.append(average_color)
    except:
        missing_images.append(image_name)
average_colors = np.array(average_colors)

In [117]:
extracted_features = pd.DataFrame(average_colors)

In [118]:
extracted_features

                0           1           2
0      144.033542  144.528360  126.177575
1      121.790398  155.687759  171.200175
2      121.549187    8.156449    7.397939
3      193.156250  182.033183  103.955656
4      112.079959  136.003707  169.840143
...           ...         ...         ...
51295  144.386420   98.107721   80.842494
51296   91.739557   81.838090   49.942841
51297   68.825335   63.520069   72.904835
51298  118.814274   82.102240   69.356844
51299  175.357661  117.538425   89.318300

[51300 rows x 3 columns]

In [73]:
title_words = np.array(X["Title"].str.split())

count_words = np.array([len(x) for x in title_words])

In [104]:
count_words

array([7, 7, 7, ..., 5, 1, 8])

In [82]:
count_capital_letters = lambda s: sum(1 for c in s if c.isupper())

In [120]:
capital_counts = X["Title"].apply(count_capital_letters)

capital_ratio = np.array(capital_counts/count_words)

extracted_features["capital_ratio"] = capital_ratio

In [89]:
count_letters = lambda s: sum(1 for c in s if c.isalpha())

In [105]:
letter_counts = X["Title"].apply(count_letters)

letter_ratio = np.array(letter_counts/count_words)

extracted_features["letter_ratio"] = letter_ratio

In [122]:
extracted_features

                0           1           2  capital_ratio  letter_ratio
0      144.033542  144.528360  126.177575       0.857143      5.000000
1      121.790398  155.687759  171.200175       1.000000      6.857143
2      121.549187    8.156449    7.397939       1.285714      6.857143
3      193.156250  182.033183  103.955656       0.857143      5.285714
4      112.079959  136.003707  169.840143       0.909091      5.090909
...           ...         ...         ...            ...           ...
51295  144.386420   98.107721   80.842494       1.000000      5.500000
51296   91.739557   81.838090   49.942841       0.777778      5.333333
51297   68.825335   63.520069   72.904835       0.800000      4.400000
51298  118.814274   82.102240   69.356844       1.000000      7.000000
51299  175.357661  117.538425   89.318300       1.000000      4.750000

[51300 rows x 5 columns]

In [ ]:
count_punctuation = lambda s: sum(1 for c in s if c in string.punctuation)

In [123]:
punct_counts = X["Title"].apply(count_letters)
extracted_features["punct_counts"] = punct_counts